In [28]:
import pandas as pd
import csv
import matplotlib as plot

In [29]:
deadout_df = pd.read_csv("bee_data/bee_loss_deadout.csv")
collapse_df = pd.read_csv("bee_data/colony_collapse_bees.csv")

deadout_df.dropna(axis=1, how="all").copy()
collapse_df.dropna(axis=1, how="all").copy()

,Program,Year,Period,Geo Level,State,State ANSI,watershed_code,Commodity,Data Item,Domain,Domain Category,Value
0,SURVEY,2020,JAN THRU MAR,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"105,240"
1,SURVEY,2020,JAN THRU MAR,STATE,ALABAMA,1.0,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,70
2,SURVEY,2020,JAN THRU MAR,STATE,ARIZONA,4.0,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"4,300"
3,SURVEY,2020,JAN THRU MAR,STATE,ARKANSAS,5.0,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,390
4,SURVEY,2020,JAN THRU MAR,STATE,CALIFORNIA,6.0,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"19,000"
...,...,...,...,...,...,...,...,...,...,...,...,...
247,SURVEY,2015,YEAR,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",INVENTORY OF BEE COLONIES,INVENTORY OF BEE COLONIES: (LESS THAN 5 COLONIES),"7,000"
248,SURVEY,2015,JAN THRU MAR,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"92,250"
249,SURVEY,2015,APR THRU JUN,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"56,760"
250,SURVEY,2015,JUL THRU SEP,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"88,390"
251,SURVEY,2015,OCT THRU DEC,NATIONAL,US TOTAL,NaN,0,HONEY,"HONEY, BEE COLONIES - LOSS, COLONY COLLAPSE DI...",TOTAL,NOT SPECIFIED,"87,610"

In [30]:
deadout_df["Value"] = deadout_df["Value"].str.replace(",","")
deadout_df['Value'] = deadout_df['Value'].astype('int64')
deadout = deadout_df.groupby(['Year', 'State',], as_index=False)[['Value']].sum()
deadout = deadout.rename(columns = {
    'Year': 'year',
    'State': 'state',
    'Value': 'deadout'
    })
deadout

     year          state  deadout
0    2015        ALABAMA     4670
1    2015        ARIZONA    28100
2    2015       ARKANSAS    14800
3    2015     CALIFORNIA   584000
4    2015       COLORADO    10400
..    ...            ...      ...
277  2020       VIRGINIA     2300
278  2020     WASHINGTON     4600
279  2020  WEST VIRGINIA     1670
280  2020      WISCONSIN     3200
281  2020        WYOMING     1740

[282 rows x 3 columns]

In [31]:
collapse_df["Value"] = collapse_df["Value"].str.replace(",","")
collapse_df['Value'] = collapse_df['Value'].astype('int64')
collapse = collapse_df.groupby(['Year', 'State',], as_index=False)[['Value']].sum()
collapse = collapse.rename(columns = {
    'Year': 'year',
    'State': 'state',
    'Value': 'cc_syn'
    })
collapse

    year          state  cc_syn
0   2015       US TOTAL  332010
1   2016       US TOTAL  391130
2   2017       US TOTAL  251130
3   2018       US TOTAL  330680
4   2019        ALABAMA     430
..   ...            ...     ...
92  2020       VIRGINIA     540
93  2020     WASHINGTON    6870
94  2020  WEST VIRGINIA     330
95  2020      WISCONSIN    1690
96  2020        WYOMING    2000

[97 rows x 3 columns]

In [32]:
combined = deadout.merge(collapse, on=['state','year'])
combined

    year          state  deadout  cc_syn
0   2015       US TOTAL  1756860  332010
1   2016       US TOTAL  1674960  391130
2   2017       US TOTAL  1534610  251130
3   2018       US TOTAL  1615150  330680
4   2019        ALABAMA     2300     430
..   ...            ...      ...     ...
92  2020       VIRGINIA     2300     540
93  2020     WASHINGTON     4600    6870
94  2020  WEST VIRGINIA     1670     330
95  2020      WISCONSIN     3200    1690
96  2020        WYOMING     1740    2000

[97 rows x 4 columns]

In [33]:
combined.loc[combined['state'] == 'OTHER STATES']

    year         state  deadout  cc_syn
37  2019  OTHER STATES     4010     140